zoulincheng/stm32chip_project/net/contiki/cpu/stm32F103/si4438/radiolib/si446x_rf.c
#include "contiki.h"
#include "dev/radio.h"
#include "net/mac/frame802154.h"
#include "net/netstack.h"
#include "net/packetbuf.h"
#include "net/rime/rimestats.h"
#include "sys/rtimer.h"
#include "net/rpl/rpl.h"
#include "lib/random.h"
#include "basictype.h"

//#include "si4438.h"
#include "si446x_defs_u.h"
#include "si446x_cmd.h"
#include "si446x.h"

#include "stm32f10x.h"
#include "sysprintf.h"
#include "iodef.h"


#include <string.h>
#include "hwgg.h"
#include "apphwgg.h"

/*---------------------------------------------------------------------------*/
PROCESS(si446x_radio_process, "si446x radio driver");
/*---------------------------------------------------------------------------*/
PROCESS(si446x_rxled_process, "rx_led");
/*---------------------------------------------------------------------------*/
PROCESS(si446x_txled_process, "tx_led");
/*---------------------------------------------------------------------------*/
PROCESS(si446x_sendack_process, "send ack");
/*---------------------------------------------------------------------------*/
PROCESS(hwgg_rf_process,"hwgg_rf");
PROCESS_NAME(rf_param_process);
extern process_event_t event_msg_rf_param;


/*---------------------------------------------------------------------------*/
static int si446x_radio_rf_init(void);
static int si446x_radio_prepare(const void *payload,unsigned short payload_len);
static int si446x_radio_transmit(unsigned short payload_len);
static int si446x_radio_send(const void *data, unsigned short len);
static int si446x_radio_read(void *buf, unsigned short bufsize);
static int si446x_radio_channel_clear(void);
static int si446x_radio_receiving_packet(void);
static int si446x_radio_pending_packet(void);
static int si446x_radio_on(void);
static int si446x_radio_off(void);
static int add_to_rxbuf(uint8_t * src);
static int read_from_rxbuf(void *dest, unsigned short len);
static void send_ack(frame802154_t info154);
static void rf_set_check_timer(void);

#define SI446X_ACK_154_LEN		11
#define SI446X_MAX_PACKET_LEN	126
#define SI446X_CUR_RSSI			128

/*
 * The buffers which hold incoming data.
 */
#ifndef SI446X_RADIO_RXBUFS
#define SI446X_RADIO_RXBUFS 1
#endif 


/* +1 because of the first byte, which will contain the length of the packet. */
// +1 last data is rssi
//len1 [data] rssi1
/*----------------------------------------------------------------------*/
static uint8_t si446x_rxbufs[SI446X_RADIO_RXBUFS][SI446X_MAX_PACKET_LEN + 1 + 1+ 1];//len1 [data] rssi1  last_rssi

#if SI446X_RADIO_RXBUFS > 1
static volatile int8_t first = -1, last = 0;
#else   
static const int8_t first = 0, last = 0;
#endif  

#if SI446X_RADIO_RXBUFS > 1
#define CLEAN_RXBUFS() do{first = -1; last = 0;}while(0)
#define RXBUFS_EMPTY() (first == -1)
static int RXBUFS_FULL( )
{
	int8_t first_tmp = first;
	return first_tmp == last;
}
#else 
#define CLEAN_RXBUFS( ) (si446x_rxbufs[0][0] = 0)
#define RXBUFS_EMPTY( ) (si446x_rxbufs[0][0] == 0)
#define RXBUFS_FULL( ) (si446x_rxbufs[0][0] != 0)
#endif 


/*----------------------------------------------------------------------*/
#define END_NODE_RXBUFS	 	16
#define END_NODE_BUF_LEN	32
#define END_NODE_RSSI_INDEX	(END_NODE_BUF_LEN-1)

static uint8_t end_node_rxbufs[END_NODE_RXBUFS][END_NODE_BUF_LEN];

#if END_NODE_RXBUFS > 1
static volatile int8_t end_node_first = -1, end_node_last = 0;
#else   
static const int8_t end_node_first = 0, end_node_last = 0;
#endif  

#if END_NODE_RXBUFS > 1
#define CLEAN_END_NODE_RXBUFS() do{end_node_first = -1; end_node_last = 0;}while(0)
#define END_NODE_RXBUFS_EMPTY() (end_node_first == -1)
static int END_NODE_RXBUFS_FULL( )
{
	int8_t first_tmp = end_node_first;
	return first_tmp == end_node_last;
}
#else 
#define CLEAN_END_NODE_RXBUFS( ) (end_node_rxbufs[0][0] = 0)
#define END_NODE_RXBUFS_EMPTY( ) (end_node_rxbufs[0][0] == 0)
#define END_NODE_RXBUFS_FULL( )  (end_node_rxbufs[0][0] != 0)
#endif 


static uint8_t si446x_txbuf[SI446X_MAX_PACKET_LEN + 1 + 1];//128Bytes

#define CLEAN_TXBUF() (si446x_txbuf[0] = 0)
#define TXBUF_EMPTY() (si446x_txbuf[0] == 0)

#define BUSYWAIT_UNTIL(cond, max_time)                                    \
    do {                                                                  \
      rtimer_clock_t t0;                                                  \
      t0 = RTIMER_NOW();                                                  \
      while(!(cond) && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (max_time)));   \
    } while(0)

static volatile uint8_t onoroff = 0;//OFF;
static volatile int8_t last_rssi;

static u_char ubcurrssi;
static uint8_t locked;

static volatile uint8_t is_transmitting;
static volatile uint8_t seqnum;
static volatile linkaddr_t destaddr;

volatile uint8_t ubAckData[3];
volatile uint8_t  ubACKFlag;

static process_event_t rx_led_event;
static process_event_t tx_led_event;

static volatile uint8_t rf_state_led_lock = 0;

volatile  SI446X_STATE si446x_state = SI446X_IDLE;
volatile uint8_t ubRxFlag;

volatile u_short  count_tx = 0;
volatile u_short  count_rx = 0;
static struct ctimer period_rf_timer;

static struct etimer et_led;


#define RF_RSSI_THD	   100

extern void sysPrintExp(unsigned int dwPos);
extern u_long sysGetLR(void);

/* If set to 1, a send() returns only after the packet has been transmitted.
  This is necessary if you use the x-mac module, for example. */
#ifndef RADIO_WAIT_FOR_PACKET_SENT
#define RADIO_WAIT_FOR_PACKET_SENT 1
#endif  /* RADIO_WAIT_FOR_PACKET_SENT */


static u_char ubarxbuf[129] = {0x00};

#define GET_LOCK() locked++

/*--------------------------------------------------------------------------*/
static void RELEASE_LOCK(void)
{
	if(locked > 0)
		locked--;
}


/*---------------------------------------------------------------------------*/
static int si446x_radio_rf_init(void)
{
	si446xRadioInit( );
	onoroff = 0;//OFF;
	locked = 0;
	si446x_state = SI446X_IDLE;

	CLEAN_RXBUFS();
	CLEAN_TXBUF();

	process_start(&si446x_radio_process, NULL);
	process_start(&si446x_sendack_process, NULL);
	rf_set_check_timer( );
	return 0;
}

