zoulincheng/stm32chip_project/net/contiki/cpu/stm32F103/si4438/radiolib/si446x_rf.c
/*---------------------------------------------------------------------------*/
static int si446x_radio_transmit(unsigned short payload_len)
{
	#define DEBUGTEST 1
	//si446x_txbuf[0] = payload_len;  //data packet length 
	si446x_txbuf[0] = payload_len + 2;  //data packet length  + 2 BYTE CRC

	GET_LOCK();

	while((si446x_state & SI446X_TX) || (si446x_state & SI446X_RX))
	{	
        /* we are not transmitting. This means that
           we just started receiving a packet or sending a paket,
           so we drop the transmission. */
		XPRINTF((10, "SEND DROP-----------\r\n"));       
		RELEASE_LOCK();
        return RADIO_TX_COLLISION;
     }

	XPRINTF((12, "Tx clock_start is %d\r\n", clock_time( )));
	si446x_state = SI446X_TX;
	is_transmitting = 1;
	if(si446xRadioSendFixLenData(si446x_txbuf) == 0x00) 
	{
		frame802154_t info154;
		frame802154_parse((u_char *)&si446x_txbuf[1], payload_len, &info154);
		if(info154.fcf.frame_type == FRAME802154_DATAFRAME &&info154.fcf.ack_required != 0)
		{
			seqnum = info154.seq;
			memcpy((void*)&destaddr, info154.dest_addr, 8);
			
			XPRINTF((12, "seqnum %02x\r\n", seqnum));
			MEM_DUMP(12, "dest", (void *)&destaddr, 8);
		}
		#if  DEBUGTEST > 0
		{
			XPRINTF((10, "Tx clock_end is %d\r\n", clock_time( )));
			MEM_DUMP(10, "TX->",(u_char*)si446x_txbuf, si446x_txbuf[0]+1);
		}
		#endif
		CLEAN_TXBUF( );
		is_transmitting = 0;
		RELEASE_LOCK( );
		si446x_state = SI446X_IDLE; // when send packet, return IDLE state
		//memset((u_char*)si4432_txbuf, 0, si4432_txbuf[0] + 1);//clear txbuf
		process_post(&si446x_txled_process, tx_led_event, NULL);
		return RADIO_TX_OK;
	}
	else
	{
		RELEASE_LOCK( );
		/* TODO: Do we have to retransmit? */
		CLEAN_TXBUF( );
		XPRINTF((10, "transmit error\r\n"));
		si446x_recfg( );//init again 
		is_transmitting = 0;
		si446x_state = SI446X_IDLE; // when send packet, return IDLE state
		return RADIO_TX_ERR;
	}
}





/*---------------------------------------------------------------------------*/
static int si446x_radio_prepare(const void *payload, unsigned short payload_len)
{
	u_short uwCrc = 0;
	GET_LOCK( );
	if(payload_len > SI446X_MAX_PACKET_LEN) 
	{
		XPRINTF((10,"SI4432: payload length=%d is too long.\r\n", payload_len));
		RELEASE_LOCK( );
		return RADIO_TX_ERR;
	}
	#if !RADIO_WAIT_FOR_PACKET_SENT
	/* 
	* Check if the txbuf is empty. Wait for a finite time.
	* This should not occur if we wait for the end of transmission in 
	* si446x_radio_transmit().
	*/
	if(wait_for_tx()) 
	{
		XPRINTF((10,"si446x: radio prepare tx buffer full.\r\n"));
		RELEASE_LOCK( );
		return RADIO_TX_ERR;
	}
	#endif /* RADIO_WAIT_FOR_PACKET_SENT */
	
	/*
	* Copy to the txbuf. 
	* The first byte must be the packet length.
	*/
	CLEAN_TXBUF();
	uwCrc = crc16_data((const u_char*)payload, payload_len,0);
	memcpy(si446x_txbuf+1, payload, payload_len);
	si446x_txbuf[payload_len + 1] = uwCrc &0xff;
	si446x_txbuf[payload_len + 2] = (uwCrc>>8)&0xff;

	RELEASE_LOCK( );
	return RADIO_TX_OK;
}


/*---------------------------------------------------------------------------*/
int si446x_radio_send(const void *payload, unsigned short payload_len)
{
	si446x_radio_prepare(payload, payload_len);
	return si446x_radio_transmit(payload_len);
}

/*---------------------------------------------------------------------------*/
static int si446x_radio_off(void)
{
	return 1;
}
/*---------------------------------------------------------------------------*/
static int si446x_radio_on(void)
{
	return 1;
}



/*---------------------------------------------------------------------------*/
static int wait_for_tx(void)
{
	struct timer t;
	timer_set(&t, CLOCK_SECOND / 6);
	while(!TXBUF_EMPTY()) 
	{
		if(timer_expired(&t)) 
		{
			XPRINTF((10,"si446x: tx buffer full.\r\n"));
			return 1;
		}
		//PRINTF("In wait for tx\r\n");
		/* Put CPU in sleep mode. */
		//halSleepWithOptions(SLEEPMODE_IDLE, 0);
	}
	return 0;
}


/*---------------------------------------------------------------------------*/
static int si446x_radio_channel_clear(void)
{
  //return ST_RadioChannelIsClear();
  	if ((si446x_state&SI446X_RX_RECEIVING == SI446X_RX_RECEIVING)||(si446x_state&SI446X_TX == SI446X_TX))
  	{
  		return 0;//rf busy
  	}

  	//need be improve
  	if (si446x_get_cur_rssi( ) > RF_RSSI_THD)
  	{
  		return 0;//busy
  	}
	return 1;
}


/*---------------------------------------------------------------------------*/
static int si446x_radio_receiving_packet(void)
{
  //return receiving_packet;
    return si446x_state & SI446X_RX_RECEIVING;
}

/*---------------------------------------------------------------------------*/
static int si446x_radio_pending_packet(void)
{
  return !RXBUFS_EMPTY();
}


/*---------------------------------------------------------------------------*/
int si446x_radio_is_on(void)
{
  return onoroff == 1;//ON;
}


/*---------------------------------------------------------------------------*/
static int si446x_radio_read(void *buf, unsigned short bufsize)
{
  return read_from_rxbuf(buf, bufsize);
}


/*---------------------------------------------------------------------------*/
static int add_to_rxbuf(uint8_t *src)
{
	if(RXBUFS_FULL()) 
	{
		return 0;
	}

	memcpy(si446x_rxbufs[last], src, src[0] + 1);//src[0] is data length in buf not include src[0], so all data length need to add 1 
	si446x_rxbufs[last][SI446X_CUR_RSSI] = src[SI446X_CUR_RSSI];
	//memcpy(si4432_rxbufs[last], src, src[0]);
	#if SI446X_RADIO_RXBUFS > 1
	last = (last + 1) % SI446X_RADIO_RXBUFS;
	if(first == -1) 
	{
		first = 0;
	}
	#endif
	
	memset(src, 0, src[0] + 1);//clear buf
	return 1;
}

/*---------------------------------------------------------------------------*/
static int add_to_end_node_rxbuf(uint8_t *src)
{
	if(END_NODE_RXBUFS_FULL()) 
	{
		return 0;
	}

	memcpy(end_node_rxbufs[end_node_last], src, src[0]);//src[0] is data length include total packet length 
	end_node_rxbufs[end_node_last][END_NODE_RSSI_INDEX] = src[SI446X_CUR_RSSI];
	#if END_NODE_RXBUFS > 1
	end_node_last = (end_node_last + 1) % END_NODE_RXBUFS;
	if(end_node_first == -1) 
	{
		end_node_first = 0;
	}
	#endif
	
	memset(src, 0, src[0]);//clear buf
	return 1;
}

