zoulincheng/stm32chip_project/net/contiki/cpu/stm32F103/si4438/radiolib/si446x_rf.c
/*---------------------------------------------------------------------------*/
static int read_from_rxbuf(void *dest, unsigned short len)
{
	//PRINTF("first 0   %d\r\n", first);
	u_char  packet_rssi;
	int8_t rssi;
	if(RXBUFS_EMPTY()) 
	{          
		return 0;
	}

	if(si446x_rxbufs[first][0] > len) 
	{   /* Too large packet for dest. */
		len = 0;
	} 
	else 
	{
		//len = si446x_rxbufs[first][0];
		len = si446x_rxbufs[first][0]-2;
		packet_rssi = si446x_rxbufs[first][SI446X_CUR_RSSI];
		rssi = -((int8_t)((0xff-packet_rssi)>>1));
		XPRINTF((10, "prssi %d last_rssi %d  rssi %d\r\n", packet_rssi, last_rssi, rssi));
		//memcpy(dest, (uint8_t*)&si446x_rxbufs[first][0] + 1, len);
		memcpy(dest, (uint8_t*)&si446x_rxbufs[first][0] + 1, len);
		//packetbuf_set_attr(PACKETBUF_ATTR_RSSI, last_rssi);
		packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rssi);
	}

	#if SI446X_RADIO_RXBUFS > 1
	{
		int first_tmp;
		first = (first + 1) % SI446X_RADIO_RXBUFS;
		first_tmp = first;
		if(first_tmp == last) 
		{
			CLEAN_RXBUFS();
		}
	}
	#else
	CLEAN_RXBUFS();
	#endif

	return len;
}


/*---------------------------------------------------------------------------*/
static int read_from_end_node_rxbuf(void *dest, unsigned short len)
{
	//PRINTF("first 0   %d\r\n", first);
	u_char  packet_rssi;
	int8_t rssi;
	u_char *pdata = (u_char *)dest;
	if(END_NODE_RXBUFS_EMPTY()) 
	{          
		return 0;
	}

	if(end_node_rxbufs[end_node_first][0] > len) 
	{   /* Too large packet for dest. */
		len = 0;
	} 
	else 
	{
		len = end_node_rxbufs[end_node_first][0]-1;  //frame length
		packet_rssi = end_node_rxbufs[end_node_first][END_NODE_RSSI_INDEX];
		rssi = -((int8_t)((0xff-packet_rssi)>>1));
		XPRINTF((10, "prssi %d last_rssi %d  rssi %d\r\n", packet_rssi, last_rssi, rssi));
		memcpy(dest, (uint8_t*)&end_node_rxbufs[end_node_first][0] + 1, len);//copy frame to buf
		pdata[END_NODE_RSSI_INDEX] = packet_rssi;		
	}

	#if END_NODE_RXBUFS > 1
	{
		int first_tmp;
		end_node_first = (end_node_first + 1) % END_NODE_RXBUFS;
		first_tmp = end_node_first;
		if(first_tmp == end_node_last) 
		{
			CLEAN_END_NODE_RXBUFS();
		}
	}
	#else
	CLEAN_END_NODE_RXBUFS();
	#endif
	return len;
}


void end_node_frame_save(uint8_t *src)
{
	u_char ubLen = src[0];
	if (src[1] == HWGG_HEAD && src[ubLen-1] == HWGG_END)
	{
		if (isMyPacket((const u_char *)&src[1]))
		{
			add_to_end_node_rxbuf(src);
			process_poll(&hwgg_rf_process);
		}
	}
}




static void send_ack(frame802154_t info154)
{
	uint8_t ackdata[16] = {0};

	if(is_transmitting || ((si446x_state & SI446X_RX_RECEIVING)== SI446X_RX_RECEIVING)) 
	{
		/* Trying to send an ACK while transmitting  or is receiving - should not be
		possible, so this check is here only to make sure. */
		return;
	}
	ackdata[0] = 11; //ack length
	ackdata[1] = FRAME802154_ACKFRAME;
	ackdata[2] = 0;
	ackdata[3] = info154.seq;
	memcpy(&ackdata[4], &linkaddr_node_addr, 8);

	/* Send packet length */
	is_transmitting = 1;
	si446xRadioSendFixLenData(ackdata);
	is_transmitting = 0;

	MEM_DUMP(10, "ac->", ackdata, 12);
}

/******************************************************************/
PROCESS_THREAD(si446x_radio_process, ev, data)
{
	int len;

	PROCESS_BEGIN();
	XPRINTF((10,"rf_radio_process: started\r\n"));
	rx_led_event = process_alloc_event( );
	tx_led_event = process_alloc_event( );	

	process_start(&si446x_rxled_process,NULL);
	process_start(&si446x_txled_process,NULL);
	process_start(&hwgg_rf_process,NULL);

	//process_start(&rf_rssi_process, NULL);
	
	while(1) 
	{
		PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);

		packetbuf_clear();
		len = si446x_radio_read(packetbuf_dataptr(), PACKETBUF_SIZE);
		if(len > 0) 
		{
			packetbuf_set_datalen(len);

			NETSTACK_RDC.input();
			process_post(&si446x_rxled_process, rx_led_event, NULL);
		}
		if(!RXBUFS_EMPTY()) 
		{
			/*
			* Some data packet still in rx buffer (this happens because process_poll
			* doesn't queue requests), so stm32w_radio_process needs to be called
			* again.
			*/
			process_poll(&si446x_radio_process);
		}
	}
	PROCESS_END();
}




/******************************************************************/
PROCESS_THREAD(hwgg_rf_process, ev, data)
{
	int len;
	static u_char ubHwggBuf[32];

	PROCESS_BEGIN();
	XPRINTF((10,"hwgg_rf_process: started\r\n"));
	
	while(1) 
	{
		PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);
		len = read_from_end_node_rxbuf(ubHwggBuf, END_NODE_BUF_LEN);
		if(len > 0) 
		{
			MEM_DUMP(6, "<-en", ubHwggBuf, len);
			process_post_synch(&app_hwgg_process, app_hwgg_event, ubHwggBuf);
		}
		if(!END_NODE_RXBUFS_EMPTY()) 
		{
			process_poll(&hwgg_rf_process);
		}
	}
	PROCESS_END();
}





static int is_broadcast_addr(uint8_t mode, uint8_t *addr)
{
  int i = mode == FRAME802154_SHORTADDRMODE ? 2 : 8;
  while(i-- > 0) {
    if(addr[i] != 0xff) {
      return 0;
    }
  }
  return 1;
}



/******************************************************************/
PROCESS_THREAD(si446x_sendack_process, ev, data)
{
	frame802154_t info154;
	static u_char ubdata[16];
	int c = 0;
	u_short uwCrc;
	u_short uwDCRC;
	u_short ubLen;

	PROCESS_BEGIN();
	XPRINTF((10, "start si446x_sendack\r\n"));
	
	while(1) 
	{
		PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);

		ubLen = ubarxbuf[0];
		uwCrc = crc16_data((const u_char*)&ubarxbuf[1], ubLen-2, 0);
		uwDCRC = (ubarxbuf[ubLen]<<8)|(ubarxbuf[ubLen-1]);
		end_node_frame_save(ubarxbuf);
		if((ubarxbuf[0] >= (SI446X_ACK_154_LEN+1))&& ((ubarxbuf[SI446X_CUR_RSSI]) > 60) &&(uwCrc == uwDCRC)) //rssi_reg value
		//if((ubarxbuf[0] > (SI446X_ACK_154_LEN+1))) //rssi_reg value
		{
      		/* Send a link-layer ACK before reading the full packet. */
      		/* Try to parse the incoming frame as a 802.15.4 header. */
			/* For dataframes that has the ACK request bit set and thatis destined for us, we send an ack. */
			c = frame802154_parse((u_char *)&ubarxbuf[1], ubarxbuf[0], &info154);
			if(is_broadcast_addr(FRAME802154_SHORTADDRMODE,(uint8_t *)&info154.dest_addr) ||
  			   is_broadcast_addr(FRAME802154_LONGADDRMODE,(uint8_t *)&info154.dest_addr) ||
               linkaddr_cmp((linkaddr_t *)&info154.dest_addr,&linkaddr_node_addr)) 
            {
				if( info154.fcf.frame_type == FRAME802154_DATAFRAME &&
					info154.fcf.ack_required != 0 &&
					linkaddr_cmp((linkaddr_t *)&info154.dest_addr,&linkaddr_node_addr)) 
	            {
					send_ack(info154);
				}
				
				XPRINTF((10, "rf rx time is %d\r\n", clock_time( )));
				MEM_DUMP(8, "RX<-",ubarxbuf,ubarxbuf[0]+1);	
				XPRINTF((10, "%04x   %04x \r\n", uwCrc, uwDCRC));
				add_to_rxbuf(ubarxbuf);
				process_poll(&si446x_radio_process);
				
