zoulincheng/stm32chip_project/net/contiki/cpu/stm32F103/si4438/radiolib/si446x_rf.c
			}
      	}
      	else
      	{
			if (linkaddr_cmp((linkaddr_t *)&ubarxbuf[4],(linkaddr_t *)&destaddr)&&(ubarxbuf[3] == seqnum))
			{
				if (ubarxbuf[0] > 0)
				{
					MEM_DUMP(8, "RX<-",ubarxbuf, ubarxbuf[0]+1);
				}
			}
      		ubarxbuf[0] = 0;
      	}
    }
	PROCESS_END();
}

/******************************************************************/
//RX receive led state blue led
PROCESS_THREAD(si446x_rxled_process, ev, data)
{
	PROCESS_BEGIN();
	while (1)
	{
		#if 1
		PROCESS_YIELD_UNTIL(ev == rx_led_event);
		while(rf_state_led_lock)
		{
			PROCESS_PAUSE( );
		}
		rf_state_led_lock = 1;
		etimer_set(&et_led, 40);
		LED4(1);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		LED4(0);
		etimer_set(&et_led, 40);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));

		etimer_set(&et_led, 40);
		LED4(1);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		LED4(0);	
		etimer_set(&et_led, 40);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		rf_state_led_lock = 0;
		#endif
	}
	PROCESS_END();
}

/******************************************************************/
//TX receive led state  red led
PROCESS_THREAD(si446x_txled_process, ev, data)
{
	PROCESS_BEGIN();
	while (1)
	{
		#if 1
		PROCESS_YIELD_UNTIL(ev == tx_led_event);
		while(rf_state_led_lock)
		{
			PROCESS_PAUSE( );
		}
		rf_state_led_lock = 1;
		etimer_set(&et_led, 40);
		LED3(1);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		LED3(0);
		etimer_set(&et_led, 40);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));

		etimer_set(&et_led, 40);
		LED3(1);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		LED3(0);
		etimer_set(&et_led, 40);
		PROCESS_WAIT_EVENT_UNTIL(etimer_expired(&et_led));
		rf_state_led_lock = 0;
		#endif
	}
	PROCESS_END();
}


/******************************************************************/
//TX receive led state  red led
#define RF_CHECK_TIME_BASE			(30*60*CLOCK_SECOND)
#define RF_CHECK_TIME_RATE			(1000)

static void rf_check_process(void)
{
	if ( count_tx ==0 || count_rx == 0 )
	{
		ubRxFlag = 0;
		si446x_recfg( );
		si446x_state = SI446X_IDLE;

		XPRINTF((0, "rf recfg\n"));
	}
	XPRINTF((0, "tx %d, rx %d\n", count_tx, count_rx));
	count_tx = 0;
	count_rx = 0;
}




static void rf_period_check_timer(void *ptr)
{
	u_long time = 0;
	
	time = random_range_number(RF_CHECK_TIME_BASE/2, RF_CHECK_TIME_BASE, 1000);
	rf_check_process( );
	
	ctimer_set(&period_rf_timer, time, rf_period_check_timer, NULL);
}

static void rf_set_check_timer(void)
{
	u_long time = 0;
	time = random_range_number(RF_CHECK_TIME_BASE/2, RF_CHECK_TIME_BASE, 1000);
	ctimer_set(&period_rf_timer, time, rf_period_check_timer, NULL);
}


void static ph_prx_handler(void)
{
	si446xReadMutiData(ubarxbuf);

	if (ubarxbuf[0] == SI446X_ACK_154_LEN)
	{
		if (linkaddr_cmp((linkaddr_t *)&ubarxbuf[4],(linkaddr_t *)&destaddr)&&(ubarxbuf[3] == seqnum) && last_rssi > -100) 
		{
			ubACKFlag = 3;
			ubAckData[0] =  ubarxbuf[1];
			ubAckData[1] =  ubarxbuf[2];
			ubAckData[2] =  ubarxbuf[3];
		}
	}
	if (ubarxbuf[0] != 0)
	{
		ubarxbuf[SI446X_CUR_RSSI] = ubcurrssi; //add rssi to last data position
		process_poll(&si446x_sendack_process);
	}
	si446xStartRX( );
	si446x_state = SI446X_IDLE;
	ubRxFlag = 0;	
}

void static modem_syde_handler(void)
{
	//u_char ubrssi = 0;
	si446x_get_modem_status(0x00);
	ubcurrssi = Si446xCmd.GET_MODEM_STATUS.CURR_RSSI;
	last_rssi = -((int8_t)((0xff-ubcurrssi)>>1));
	//XPRINTF((0, "last_rssi = %d\r\n", last_rssi));
	ubarxbuf[0] = 0;
	si446x_state = SI446X_RX;
	ubRxFlag = 1;
}

void static chip_cmderror_handler(void)
{
	si446x_change_dev_current_state(SI446X_SLEEP);
	si446xStartRX( );
}



#if 1
void EXTI9_5_IRQHandler(void)
{	
	if (EXTI_GetITStatus(EXTI_Line6) != RESET)
	{
		U8 si446x_ph_pend = 0x00;
		U8 si446x_modem_pend = 0x00;
		U8 si446x_chip_pend = 0x00;
		//U8 ubph_en = 0x00;
		//U8 ubmodem_en = 0x00;
		//U8 ubph_flag = 0x00;
		//U8 ubmodem_flag = 0x00;

		EXTI_ClearITPendingBit(EXTI_Line6);	
				
		si446x_get_int_status( );
		si446x_ph_pend = Si446xCmd.GET_INT_STATUS.PH_PEND;
		si446x_modem_pend = Si446xCmd.GET_INT_STATUS.MODEM_PEND;
		si446x_chip_pend = Si446xCmd.GET_INT_STATUS.CHIP_PEND;
		//ubph_en = si446x_get_property_1(INT_CTL_PH_ENABLE);
		//ubmodem_en = si446x_get_property_1(INT_CTL_MODEM_ENABLE);
		
		//ubph_flag = ubph_en&si446x_ph_pend;
		//ubmodem_flag = ubmodem_en&si446x_modem_pend;
		//XPRINTF((0, "PH = %02x\r\n", ubph_en));
		
		//packet sent finish
		if (si446x_ph_pend& SI446X_INT_CTL_PH_PSENT_EN)//packet sent
		{
			si446x_set_pksent( );
			//XPRINTF((0, "PH = %02x\r\n", ubph_en));
			count_tx++;
		}
		//packet rx finish
		if (si446x_ph_pend & SI446X_INT_CTL_PH_PRX_EN)
		{
			ph_prx_handler( );
			count_rx++;
		}
		//packet crc error
		if (si446x_ph_pend & SI446X_INT_CTL_PH_CRCE_EN)
		{
			si446x_change_dev_current_state(SI446X_SLEEP);
			si446xStartRX( );
		}

		//syde
		if (si446x_modem_pend & SI446X_INT_CTL_MODEM_SYDE_EN)
		{
			modem_syde_handler();
		}

		//cmd error
		if (si446x_chip_pend & SI446X_INT_CTL_CHIP_CMERR_EN)
		{
			chip_cmderror_handler( );
			XPRINTF((0, "cmd_error\n"));
		}
	}
}


#endif


/*--------------------------------------------------------------------------*/
const struct radio_driver si446x_radio_driver = {
  si446x_radio_rf_init,
  si446x_radio_prepare,
  si446x_radio_transmit,
  si446x_radio_send,
  si446x_radio_read,
  si446x_radio_channel_clear,
  si446x_radio_receiving_packet,
  si446x_radio_pending_packet,
  si446x_radio_on,
  si446x_radio_off,
};



